tutorials/multiRegion/film/hotBoxes/0/fluid/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentViscosity];

internalField   uniform 1e-7;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    sides
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    film
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
